# MAVEN MOVIES DATABASE - ANALYTICS USING SQL AND PYTHON3

## This database belongs to maven analytics and I'll be using it to answer some key question a manager or supervisor of the maven movies store might ask

#### The Database is in MySql and I'll be using MySql connector to query the Database , I'll also try to create visualizations regarding the queried data , which help in informed decision making

In [1]:
import mysql.connector
from tabulate import tabulate

<img src="C:\Users\HP\Desktop\Sql Analyticss\SQL-Analytics\python-database.jpg" width = 600 height =600 />

## Connecting to Database and Password has been removed for privacy purposes

#### Creating a cursor to parse the database

In [2]:


mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="!harshcutyi1A"
)

In [3]:
mycursor = mydb.cursor()

<img src="C:\Users\HP\Desktop\Sql Analyticss\SQL-Analytics\ER.png"  />

#### A simple query to get the store_id , last_name and first_name of 5 customers

In [4]:
mycursor.execute("USE mavenmovies")
mycursor.execute("SELECT store_id,last_name,first_name FROM customer LIMIT 5 ")
myresult = mycursor.fetchall()
print(tabulate(myresult, headers = ['store_id','last_name','first_name'] ,tablefmt='mysql'))

  store_id  last_name    first_name
----------  -----------  ------------
         1  SMITH        MARY
         1  JOHNSON      PATRICIA
         1  WILLIAMS     LINDA
         2  JONES        BARBARA
         1  BROWN        ELIZABETH

## 1.	We will need a list of all staff members, including their first and last names, email addresses, and the store identification number where they work.

In [5]:
query = """

SELECT first_name, last_name , email , store_id
FROM staff
"""
mycursor.execute(query)
myresult = mycursor.fetchall()
print(tabulate(myresult, headers = ['first_name', 'last_name' , 'email' , 'store_id'] ,tablefmt='mysql'))

first_name    last_name    email                           store_id
------------  -----------  ----------------------------  ----------
Mike          Hillyer      Mike.Hillyer@sakilastaff.com           1
Jon           Stephens     Jon.Stephens@sakilastaff.com           2

#### We can also convert the queried output to a pandas dataFrame and then can carry out visualiztion / cleaning etc

In [6]:
import pandas as pd

In [7]:
query = """

SELECT first_name, last_name , email , store_id
FROM staff
"""
mycursor.execute(query)

myresult = mycursor.fetchall()

In [8]:
df_query1 = pd.DataFrame(myresult)

column_names = [i[0] for i in mycursor.description]

df_query1.columns = column_names

In [9]:
df_query1

  first_name last_name                         email  store_id
0       Mike   Hillyer  Mike.Hillyer@sakilastaff.com         1
1        Jon  Stephens  Jon.Stephens@sakilastaff.com         2

## 2. We will need separate counts of inventory items held at each of your two stores

In [10]:
query = """
SELECT COUNT(inventory_id) AS no_of_items, store_id
FROM inventory 
GROUP BY store_id
"""
mycursor.execute(query)

myresult = mycursor.fetchall()
df_query2 = pd.DataFrame(myresult)

column_names = [i[0] for i in mycursor.description]

df_query2.columns = column_names

In [11]:
df_query2

   no_of_items  store_id
0         2270         1
1         2311         2

## 3.	We will need a count of active customers for each of your stores. Separately, please.

In [24]:
query = """
SELECT COUNT(customer_id) AS no_of_active_customer, store_id
FROM customer
WHERE active = '%d'
GROUP BY store_id
 
""" % (1)
mycursor.execute(query)

myresult = mycursor.fetchall()
df_query3 = pd.DataFrame(myresult)

column_names = [i[0] for i in mycursor.description]

df_query3.columns = column_names

In [25]:
df_query3

   no_of_active_customer  store_id
0                    318         1
1                    266         2

## 4.	In order to assess the liability of a data breach, we will need you to provide a count of all customer email addresses stored in the database.

In [26]:
query = """
SELECT count(DISTINCT(email)) AS No_of_emails
FROM customer;
"""
mycursor.execute(query)

myresult = mycursor.fetchall()
df_query4 = pd.DataFrame(myresult)

column_names = [i[0] for i in mycursor.description]

df_query4.columns = column_names

In [27]:
df_query4

   No_of_emails
0           599

## 5.	We are interested in how diverse your film offering is as a means of understanding how likely you are to keep customers engaged in the future. Please provide a count of unique film titles you have in inventory at each store and then provide a count of the unique categories of films you provide.

In [28]:
query = """
SELECT count(DISTINCT(film_id)) AS no_of_distinct_films ,store_id
FROM inventory 
GROUP BY store_id;
"""
mycursor.execute(query)

myresult = mycursor.fetchall()
df_query5 = pd.DataFrame(myresult)

column_names = [i[0] for i in mycursor.description]

df_query5.columns = column_names

In [29]:
df_query5

   no_of_distinct_films  store_id
0                   759         1
1                   762         2

In [30]:
query = """
SELECT count(DISTINCT(film_id)) AS no_of_distinct_films ,category_id
FROM film_category 
GROUP BY category_id;
"""

mycursor.execute(query)

myresult = mycursor.fetchall()
df_query5 = pd.DataFrame(myresult)

column_names = [i[0] for i in mycursor.description]

df_query5.columns = column_names

In [31]:
df_query5

    no_of_distinct_films  category_id
0                     64            1
1                     66            2
2                     60            3
3                     57            4
4                     58            5
5                     68            6
6                     62            7
7                     69            8
8                     73            9
9                     61           10
10                    56           11
11                    51           12
12                    63           13
13                    61           14
14                    74           15
15                    57           16

## 6.	We would like to understand the replacement cost of your films. Please provide the replacement cost for the film that is least expensive to replace, the most expensive to replace, and the average of all films you carry. ``

In [32]:
query = """
SELECT MIN(replacement_cost), MAX(replacement_cost) , AVG(replacement_cost)
FROM film;
"""

mycursor.execute(query)

myresult = mycursor.fetchall()
df_query6 = pd.DataFrame(myresult)

column_names = [i[0] for i in mycursor.description]

df_query6.columns = column_names

In [33]:
df_query6

  MIN(replacement_cost) MAX(replacement_cost) AVG(replacement_cost)
0                  9.99                 29.99             19.984000

## 7.	We are interested in having you put payment monitoring systems and maximum payment processing restrictions in place in order to minimize the future risk of fraud by your staff.Please provide the average payment you process, as well as the maximum payment you have processed.

In [34]:
query = """
SELECT MAX(amount) AS max_payment, AVG(amount) AS avg_payment
FROM payment;
"""

mycursor.execute(query)

myresult = mycursor.fetchall()
df_query7 = pd.DataFrame(myresult)

column_names = [i[0] for i in mycursor.description]

df_query7.columns = column_names

In [35]:
df_query7

  max_payment avg_payment
0       11.99    4.200667

## 8.	We would like to better understand what your customer base looks like. Please provide a list of all customer identification values, with a count of rentals they have made all-time, with your highest volume customers at the top of the list.

In [36]:
query = """
SELECT customer_id , COUNT(rental_id) AS no_of_rentals
FROM payment
group by customer_id
ORDER BY  no_of_rentals DESC
LIMIT 10;"""

mycursor.execute(query)

myresult = mycursor.fetchall()
df_query7 = pd.DataFrame(myresult)

column_names = [i[0] for i in mycursor.description]

df_query7.columns = column_names

In [37]:
df_query7

   customer_id  no_of_rentals
0          148             46
1          526             45
2          144             42
3          236             42
4           75             41
5          197             40
6          469             40
7          178             39
8          468             39
9          137             39